// Итерация №2
// 3. Напишите программу вычисления функции:
//  x = f(a) = a^2-10


string s_a1 = Console.ReadLine();
int a1 = int.Parse(s_a1);

Console.WriteLine(a1 * a1 -10);